Repository: Belarus/OmegaT-Common.TMX
Catalog: tmx/non-segmented/drupal-7.x.tmx
Source language: en
Languages: be

source: Visit the <a href="@admin-simpletest">Testing page</a> to display a list of available tests. For comprehensive testing, select <em>all</em> tests, or individually select tests for more targeted testing. Note that it might take several minutes for all tests to complete. For more information on creating and modifying your own tests, see the <a href="@simpletest-api">Testing API Documentation</a> in the Drupal handbook.
be: Наведайце <a href="@admin-simpletest">старонку Тэсціравання</a>, каб праглядзець спіс даступных тэстаў. Для рознабаковага тэсціравання абярыце <em>ўсе</em> тэсты, або для больш мэтавага тэсціравання самі абярыце тэсты. Заўважце, каб усе тэсты завяршыліся, гэта можа заняць некалькі хвілін. Для большых звестак па стварэнню і мадыфікацыі вашых уласных тэстаў глядзіце <a href="@simpletest-api">Дакументацыю API для Тэстаў</a> у дапаможніку Drupal.

source: Visit the <a href="@forums">Forums page</a> to set up containers and forums to hold your discussion topics.
be: Наведайце <a href="@forums">Старонку форумаў</a>, каб стварыць кантэйнеры і форумы для захавання тэм вашых дыскусій.

source: Visitor
be: Наведвальнік

source: Visitors
be: Наведвальнiкi

source: Visitors can create accounts and no administrator approval is required.
be: Наведвальнікі могуць ствараць рахункі без дазволу адміністратару.

source: Visitors can create accounts but administrator approval is required.
be: Наведвальнікі могуць ствараць рахункі, але патрабуецца ўхваленьне адміністратару.

source: Visitors, but administrator approval is required
be: Наведвальнікі, але патрабуецца пацверджанне адміністратара.

source: Vocabularies
be: Раздзелы

source: Vocabulary
be: Слоўнік

source: Vocabulary ID
be: ID слоўніка

source: Vocabulary name
be: Назва слоўніка

source: Vote
be: Голас

source: Vote count
be: Колькасць галасоў

source: Vote count for choice @label
be: Колькасць галасоў за варыянт адказу @label

source: Vote count for new choice
be: Колькасць галасоў за новы варыянт адказу

source: Vote on polls
be: Галасаваць на апытаннях

source: Votes
be: Галасы

source: Votes for choice @n
be: Галасоў за варыянт @n

source: Voting results
be: Вынікі галасаваньню

source: WARNING: You are not using an encrypted connection, so your password will be sent in plain text. <a href="@https-link">Learn more</a>.
be: АСЦЯРОЖНА: Вы выкарыстоўваеце небяспечнае спалучэнне, таму ваш пароль будзе дасланы ў фармаце plain text. <a href="@https-link">Learn more</a>.

source: Wallis and Futuna
be: Уоліс і Футуна

source: Warning
be: Увага

source: Warning message
be: Папярэджанне

source: Warning: Give to trusted roles only; this permission has security implications.
be: Заўвага: прызначайце толькі давераным ролям; гэта права мае ахоўную функцыю.

source: Warning: This permission may have security implications depending on how the text format is configured.
be: Ўвага: гэты дазвол можа прывесці да праблем з бяспекай у залежнасці ад таго, як сканфігураваны тэкставы фармат.

source: We
be: срд

source: We were unable to find any installation profiles. Installation profiles tell us what modules to enable and what schema to install in the database. A profile is necessary to continue with the installation process.
be: Мы не знайшлі ніводнага ўсталёвачнага профіля. Усталёвачныя профілі кажуць нам, якія модулі дазволіць, і якую схему усталяваць для базы дадзеных. Профіль неабходны для працягу ўстановачнага працэсу.

source: Weak
be: Слабы

source: Web page addresses and e-mail addresses turn into links automatically.
be: Адрэсы вэб-старонак і e-mail адрэсы пераўтворацца ў спасылкі аўтаматычна.

source: Web server
be: Вэб сервер

source: Web services
be: Вэб-службы

source: Webform
be: Вэбформа

source: Webform enables nodes to have attached forms and questionnaires.
be: Вебформа дазваляе нодам мець далучаныя формы і апытальнікі (анкеты)

source: Webform is currently not enabled on any content types.
be: Вэбформы зараз не дазволены ў ніводным тыпе дадзеных.

source: Wed
be: сер

source: Wednesday
be: серада

source: Week
be: Тыдзень

source: Weekly
be: Кожны тыдзень

source: Weight
be: Вага

source: Weight for @block block
be: Вага для блока @block

source: Weight for @title
be: Вага для @title

source: Weight for added field
be: Вага дададзенага поля

source: Weight for added term
be: Вага дададзеннага тэрміну

source: Weight for choice @label
be: Вага выбару @label

source: Weight for new choice
be: Вага новага выбару

source: Weight for new effect
be: Вага новага эфекту

source: Weight for new field
be: Віджэт для новага поля

source: Weight for new file
be: Памер для новага файла

source: Weight for row @number
be: Вага для радка @number

source: Weight value must be numeric.
be: Значэнне вагі павінна быць лікавым.

source: Welcome (awaiting approval)
be: Сардэчна запрашаем ( чакае пацверджання)

source: Welcome (new user created by administrator)
be: Запрашаем (новы карыстальнік створаны адміністратарам)

source: Welcome (no approval required)
be: Сардэчна запрашаем (дазвол не патрабуецца)

source: Welcome to @site-name
be: Запрашаем на @site-name

source: Welsh
be: Вэльская

source: Western Sahara
be: Заходняя Сахара

source: What is OpenID?
be: Што такое OpenID?

source: What the field will be called
be: Як будзе названа поле

source: What type of data the field will store
be: Тып дадзеных, які будзе захоўваць поле

source: When a comment is being viewed by an authenticated user
be: Калі каментар праглядваецца аўтэнтыфікаваным карыстальнікам

source: When a poll is closed, visitors can no longer vote for it.
be: Па зачыненні апытання карыстальнікі ня змогуць болей браць у ім удзел.

source: When a user's profile is being viewed
be: Пры праглядзе профіля карыстальніка

source: When cancelling a user account
be: Пры выдаленні акаўнта карыстальніка

source: When cancelling the account
be: Пры выдаленні рахунка

source: When cancelling these accounts
be: Пры выдаленні гэтых аккаўнтаў

source: When cancelling your account
be: Пры адмене вашага акаўнта

source: When content is viewed by an authenticated user
be: Калі кантэнт прагледзены аўтэнтыфікаваным карыстальнікам

source: When cron runs
be: Калі крон працуе

source: When either saving a new comment or updating an existing comment
be: Калі захоўваеш новы каментар або рэдагуеш існуючы

source: When either saving new content or updating existing content
be: Ці захоўванне новага кантэнту, ці аднаўленне існуючага

source: When enabled, only users with the "Use the site in maintenance mode" <a href="@permissions-url">permission</a> are able to access your site to perform maintenance; all other visitors see the maintenance mode message configured below. Authorized users can log in directly via the <a href="@user-login">user login</a> page.
be: Толькі карыстальнікам з <a href="@permissions-url">дазволамі</a> "Выкарыстоўваць сайт у рэжыме тэхнічнага абслугоўвання" дазваляе быць бачным вашаму сайту. Усе іншыя наведвальнікі бачаць напісанае ніжэй паведамленне рэжыма тэхнічнага абслугоўвання. Аўтарызаваныя карыстальнікі могуць заходзіць на сайт праз старонку <a href="@user-login">ўваход карыстальніка</a>.

source: When enabled, the user must confirm the account cancellation via e-mail.
be: Калі дазволена, карыстальнік можа пацьвердзіць выдаленне акаўнта праз е-мэйл.

source: When enabled, the user will receive an e-mail notification after the account has been cancelled.
be: Калі гэтая функцыя ўключана, то карыстальнік атрымае паведамленне на e-mail пасля таго, як яго акаўнт быў выдалены.

source: When listing categories, those with lighter (smaller) weights get listed before categories with heavier (larger) weights. Categories with equal weights are sorted alphabetically.
be: Катэгорыі зь меншай вагай будуць паказвацца вышэй за тыя, што маюць большую вагу; катэгорыі з аднолькавай вагай будуць сартавацца паводле альфабэту.

source: When new content is created, the Node module records basic information about the content, including the author, date of creation, and the <a href="@content-type">Content type</a>. It also manages the <em>publishing options</em>, which define whether or not the content is published, promoted to the front page of the site, and/or sticky at the top of content lists. Default settings can be configured for each <a href="@content-type">type of content</a> on your site.
be: Калі створана новае змесціва, модуль Node запісвае асноўную інфармацыю пра гэтае змесціва, у тым ліку, аўтара, дату стварэння і <a href="@content-type">Тып змесціва</a>. Ён таксама кіруе <em>параметрамі публікацыі</em>, якія вызначаюць: ці з'яўляецца змесціва апублікаваным, ці прызначана на галоўную старонку сайта, ці пазначана птушкай ўверсе спісаў змесціва. Налады па змаўчанні могуць быць сканфігураваны для кожнага <a href="@content-type">тыпу змесціва</a> вашага сайта.

source: When the site-wide contact form is enabled, a link in the main <em>Navigation</em> menu is created, but the link is disabled by default. This menu link can be enabled on the <a href='@menu'>Menus administration page</a>.
be: Калі агульная кантактная форма ўключана, ствараецца спасылка ў галоўным меню <em>Navigation</em>, але па змоўчанні спасылка адключана. Гэтую спасылку можна ўключыць на <a href='@menu'>Старонцы адміністравання меню</a>.

source: When this option is checked, this translation needs to be updated because the source post has changed. Uncheck when the translation is up to date again.
be: Калі гэтая наладка праверана, гэты пераклад трэба абнавіць, таму што галоўны матэрыял (на асноўнай мове) быў зменены. Не правярайце, калі пераклад абноўлены ізноў.

source: When working with blocks, remember that all themes do <em>not</em> implement the same regions, or display regions in the same way. Blocks are positioned on a per-theme basis. Users with the <em>Administer blocks</em> permission can disable blocks. Disabled blocks are listed on the <a href="@blocks">Blocks administration page</a>, but are not displayed in any region.
be: Пры працы з блокамі, памятайце, што ўсе тэмы рэалізуюць <em>не</em> аднолькавыя рэгіёны, або паказваюць рэгіёны аднолькава. Блокі размяшчаюцца зыходзячы з тэмы. Карыстальнікі з дазволам <em>адміністраваць блокі</em> могуць выключыць блокі. Выключаныя блокі пералічаюцца на <a href="@blocks">старонцы адміністравання блокаў</a>, але не паказваюцца ні ў адным рэгіёне.

source: When you attach a file to content, you can specify whether it is <em>listed</em> or not. Listed files are displayed automatically in a section at the bottom of your content; non-listed files are available for embedding in your content, but are not included in the list at the bottom.
be: Калі вы далучаеце файл да змесціва, вы можаце ўдакладніць, адлюстроўваць яго ў <em>спісе</em> ці не. Даданыя ў спіс файлы аўтаматычна адлюстроўваюцца ўнізе вашага змесціва; не даданыя ў спіс файлы даступныя для ўбудавання ў ваша змесціва, аднак яны не ўключаны ў спіс унізе.

source: When you ban a visitor, you prevent the visitor's IP address from accessing your site. Unlike blocking a user, banning a visitor works even for anonymous users. This is most commonly used to block resource-intensive bots or web crawlers.
be: Калі вы забараняеце наведвальніка, вы прадухіляеце IP-адрас наведвальніка для дасягу на ваш сайт. У адрозненне ад блакіравання карыстальніка, забарона карыстальніка працуе і для ананімных карыстальнікаў. Гэты рэжым звычайна выкарыстоўваецца для блакіравання ботаў і пашуковых робатаў.

source: When you create a File field, you can specify a directory where the files will be stored, which can be within either the <em>public</em> or <em>private</em> files directory. Files in the public directory can be accessed directly through the web server; when public files are listed, direct links to the files are used, and anyone who knows a file's URL can download the file. Files in the private directory are not accessible directly through the web server; when private files are listed, the links are Drupal path requests. This adds to server load and download time, since Drupal must start up and resolve the path for each file download request, but allows for access restrictions.
be: Калі вы ствараеце поле Файл, вы маеце магчымасць вызначыць каталог, дзе будуць захоўвацца файлы, якія могуць быць унутры каталогу як з <em>грамадскімі</em> файламі, так і з <em>асабістымі</em>. Доступ к грамадскаму каталогу можа ажыццяўляцца наўпрост праз вэб-сервер; калі ствараецца спіс з грамадскімі файламі, то пры гэтым выкарыстоўваюцца прамыя спасылкі на файлы, і кожны, хто ведае URL файла, можа яго спампаваць. Файлы ў асабістым каталогу недаступны наўпрост праз вэб-сервер; калі ствараецца спіс з асабістымі файламі, то спасылкі на іх - гэта запыты маршрутаў Drupal. І паколькі Drupal павінен пры запуску развязваць маршрут для кожна запыту на запампоўку файла, гэта павялічвае час пры загрузцы і запампоўцы з сервера, аднак дазваляе абмежаванні доступу.

source: Whenever your site checks for available updates and finds new releases, it can notify a list of users via e-mail. Put each address on a separate line. If blank, no e-mails will be sent.
be: Кожны раз ваш сайт правярае даступныя аднаўленні і знаходзіць новыя рэлізы, аб гэтым можа папярэджваць пра ліст карыстальнікаў e-mail паведамленнямі. Размясці кожны адрас на новым радку. Калі поле будзе пустое, папярэджанні не будуць адпраўляцца.

source: Whether to apply a simple Chinese/Japanese/Korean tokenizer based on overlapping sequences. Turn this off if you want to use an external preprocessor for this instead. Does not affect other languages.
be: Вызначае, ці ўжываць простую апрацоўку кітайскай/японскай/карэйскай моваў на аснове паслядоўнасцяў, што перакрываюцца. Адключыце, калі жадаеце выкарыстоўваць для таго вонкавы прэпрацэсар. Не датычыць іншых моваў.

source: Who can register accounts?
be: Хто можа рэгiстраваць рахункi.

source: Who's new
be: Новыя карыстальнікі

source: Who's online
be: Анлайн

source: Widget
be: Віджэт

source: Widget for existing field
be: Віджэт для існуючага поля

source: Widget for new field
be: Віджэт для новага поля

source: Widget type
be: Тып віджэта

source: Width
be: Шырыня

source: Width and height can not both be blank.
be: Шырыня і вышыня не могуць быць пустымі абедзве.

source: With multiple languages enabled, interface text can be translated, registered users may select their preferred language, and authors can assign a specific language to content. <a href="@translations">Download contributed translations</a> from Drupal.org.
be: З уключэннем шматмоўнасці, ваш інтэрфейс зможа перакладацца, а зарэгістраваныя карыстальнікі атрымаюць магчымасць абіраць пажаданую мову, а аўтары змогуць вызначаць мову свайго змесціва. <a href="@translations">Спампаваць пераклады</a> з Drupal.org.

source: With the Image module you can scale, crop, resize, rotate and desaturate images without affecting the original image using <a href="@image">image styles</a>. When you change an image style, the module automatically refreshes all created images. Every image style must have a name, which will be used in the URL of the generated images. There are two common approaches to naming image styles (which you use will depend on how the image style is being applied):
be: З дапамогай модуля Image вы можаце маштабаваць, падразаць, змяняць памер, вярцець і паніжаць насычанасць малюнкаў, карыстаючыся <a href="@image">стылямі малюнка</a> без уплывання пры гэтым на зыходны малюнак. Пры змяненні стыля малюнка модуль аўтаматычна абнаўляе ўсе створаныя малюнкі. У кожнага стыля малюнка павінна быць імя, якое будзе выкарыстана ў URL утвораных малюнкаў. Існуе два агульных падыхода ў тым, як называць стылі малюнка (выкарыстанне вамі якога будзе залежыць ад таго, як стыль будзе ўжывацца):

source: Wolof
be: Валоф

source: Workflow
be: Працэс

source: Would you like to continue with the above?
be: Ці жадаеце вы працягнуць?

source: Would you like to continue with uninstalling the above?
be: Ці жадаеце вы працягнуць выдаленне?

source: Writable (<em>private</em> download method)
be: Перазапісваемы (<em>прыватны</em> метад загрузкі)

source: Writable (<em>public</em> download method)
be: Перазапісваемы (<em>публічны</em> метад загрузкі)

source: Write errors to the log
be: Занатоўваць памылкі ў рэгістар

source: Write errors to the log and to the screen
be: Занатоўваць памылкі ў рэгістар з адначасовым вывадам на экран

source: Wrong username or password.
be: Няслушнае імя карыстальніка ці пароль.

source: XML feed
be: XML-фіды

source: Xhosa
be: Гзоза

source: Year
be: Год

source: Yemen
be: Йемен

source: Yes
be: Так

source: Yesterday
be: Учора

source: Yiddish
be: Ідыш

source: Yoruba
be: Ёруба

source: You Get
be: Вы атрымоўваеце

source: You Type
be: Вы ўводзіце

source: You are currently using the %set-name shortcut set.
be: Вы зараз выкарыстоўваеце %set-name набор хуткіх спасылак.

source: You are here
be: Вы тут

source: You are here:
be: Вы тут:

source: You are logged in as %user. <a href="!user_edit">Change your password.</a>
be: Вы ўвайшлі як %user. <a href="!user_edit">Змяніце ваш пароль.</a>

source: You are not allowed to access this page.
be: Доступ да гэтай старонкі забаронены.

source: You are not allowed to categorize this feed item.
be: Недастаткова правоў для катэгарызацыі гэтага элемента ў стужцы.

source: You are not allowed to create content.
be: Вы ня маеце права ствараць матэрыялы.

source: You are not allowed to post a new blog entry.
be: Вы не можаце дадаць новы запіс у блог.

source: You are not allowed to post new content in the forum.
be: Вы не маеце доступа да дадавання новых запісаў у форуме.

source: You are not authorized to access this page.
be: У вас недастаткова правоў для прагляду гэтай старонкі.

source: You are not authorized to post comments.
be: Вы ня маеце правоў для дапісваньня камэнтараў.

source: You are not authorized to view comments.
be: Вы ня маеце правоў для прагляду камэнтараў.

source: You are now using the %set_name shortcut set.
be: Зараз вы выкарыстоўваеце %set_name наладку цэтліка.

source: You are now using the new %set_name shortcut set. You can edit it from this page or <a href="@switch-url">switch back to a different one.</a>
be: Зараз вы выкарыстоўваеце новую ўсталёўку цэтліка %set_name. Вы можаце змяняць гэта са старонкі <a href="@switch-url">ці пераключыцца на наступную</a>.

source: You can <a href="@cron">run cron manually</a>.
be: Вы можаце <a href="@cron">запусціць крон уручную</a>.

source: You can also install new modules and themes in the same fashion, through the <a href="@install">install page</a>, or by clicking the <em>Install new module/theme</em> link at the top of the <a href="@modules_page">modules</a> and <a href="@themes_page">themes</a> pages. In this case, you are prompted to provide either the URL to the download, or to upload a packaged release file from your local computer.
be: Вы можацце таксама ўсталяваць новыя модулі ці тэмы ў адным стылі, праз <a href="@install">старонку ўсталёўкі</a> ці націскаючы спасылку <em>Усталяваць новы модуль/тэму</em> ўверсе старонак <a href="@modules_page">модуляў</a> і <a href="@themes_page">тэмаў</a>. У гэтым выпадку, вам прадстаўляюць, як URL для закачкі, так і загружаны рэліз файла на вашым кампьютары.

source: You can assign a sub-term to multiple parent terms. For example, <em>fusion</em> can be assigned to both <em>rock</em> and <em>jazz</em>.
be: Вы можаце дадаць суб-тэрмін да розных зыходных тэрмінаў. Напрыклад, <em>фьюжан</em> можа быць даданы да абодвух <em>рок</em> і <em>джаз</em>.

source: You can assign it again later if you wish.
be: Вы можаце прызначыць гэта зноў пазней, калі хочаце.

source: You can assign separate permissions for <em>creating</em>, <em>editing</em>, and <em>deleting</em> book content, as well as <em>adding content to books</em>, and <em>creating new books</em>. Users with the <em>Administer book outlines</em> permission can add <em>any</em> type of content to a book by selecting the appropriate book outline while editing the content. They can also view a list of all books, and edit and rearrange section titles on the <a href="@admin-book">Book administration page</a>.
be: Вы можаце прызначыць асобныя дазволы для <em>стварэння</em>, <em>рэдагавання</em>, і <em>выдалення</em> змесціва кнігі, гэтак жа як <em>даданне матэрыялаў у кнігу</em>, і <em>стварэнне новых кніг</em>. Карыстальнікі з <em>Адміністратарскімі кніжнымі схемамі</em> дазволаў могуць дадаваць <em>любы</em> тып змесціва ў кнігу, абіраючы падыходзячую схему кнігі, пакуль рэдагуецца змесціва. Яны могуць таксама паказваць спіс усіх кніг, змяняць і перапрызначаць секцыі назваў на <a href="@admin-book">старонцы адміністравання Кнігі</a>.

source: You can automatically install your missing updates using the Update manager:
be: Вы можаце аўтаматычна інсталяваць апдэйты што адсутнічаюць, выкарыстоўваючы Мэнэджэр Апдэйтаў

source: You can choose to send e-mail only if a security update is available, or to be notified about all newer versions. If there are updates available of Drupal core or any of your installed modules and themes, your site will always print a message on the <a href="@status_report">status report</a> page, and will also display an error message on administration pages if there is a security update.
be: Вы можаце абраць адпраўку e-mail толькі калі даступныя абнаўленні бяспекі, ці быць папярэджаны аб усіх новых версіях. Калі існуюць даступныя аднаўленні ядра Drupal альбо іншых модуляў ці тэмаў, ваш сайт увесь час будзе выводзіць паведамленні <a href="@status_report">апавяшчэння стану</a> старонкі, і, калі існуюць абнаўленні бяспекі, таксама адлюстроўваць паведамленні памылак на старонках адміністратара.

source: You can display your shortcuts by enabling the Shortcuts block on the <a href="@blocks">Blocks administration page</a>. Certain administrative modules also display your shortcuts; for example, the core <a href="@toolbar-help">Toolbar module</a> displays them near the top of the page, along with an <em>Edit shortcuts</em> link.
be: Вы можаце адлюстраваць свае хуткія спасылкі праз уключэнне блокаў Shortcuts на \r <a href="@blocks">Старонцы адміністравання блокамі </a>. Дакладныя модулі адміністравання таксама адлюстроўваюць вашыя хуткія спасылкі, напрыклад, ядро <a href="@toolbar-help">модуль Toolbar</a> адлюстроўвае іх наверсе старонкі, побач са спасылкай <em>Рэдагаваць хуткія спасылкі </em>.

source: You can enable the newly-created block for this menu on the <a href="@blocks">Blocks administration page</a>.
be: Вы можаце ўключыць толькі што створаны блок для гэтага меню праз <a href="@blocks">Старонку наладкі блокаў</a>.

source: You can find <a href="@module_url">modules</a> and <a href="@theme_url">themes</a> on <a href="@drupal_org_url">drupal.org</a>. The following file extensions are supported: %extensions.
be: Вы можаце знайсці<a href="@module_url">модулі</a> і <a href="@theme_url">тэмы</a> на <a href="@drupal_org_url">drupal.org</a>. Падтрымліваюцца наступныя файлавыя пашырэнні: %extensions.

source: You can leave a message using the contact form below.
be: Вы можаце пакінуць паведамленьне праз кантактную форму ніжэй.

source: You can reorganize the terms in %capital_name using their drag-and-drop handles, and group terms under a parent term by sliding them under and to the right of the parent.
be: Вы можаце рэарганізаваць тэрміны %capital_name, выкарыстоўваючы правіла "перацягнуў ды кінуў", і групаваць тэрміны пад зыходным тэрмінам, змяшчаючы іх правей бацькоўскага (зыходнага) тэрміна.

source: You can select only formats you can use.
be: Вы можаце выбраць толькі тыя фарматы, якімі можна карыстацца.
